Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресТолькоРоссийский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонCДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМногострочноеПоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыКонтактнойИнформации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//  Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Тип;Тип");
	БлокируемыеРеквизиты.Добавить("Родитель");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Групповое изменение объектов.

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("*");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиОбновления

// Регистрирует к обработке виды контактной информации другое у которых необходимо заполнить поле ВидПоляДругое.
//
Процедура ЗаполнитьВидыКонтактнойИнформацииСПолемДругоеКОбработке(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка,
		|	ВидыКонтактнойИнформации.УдалитьМногострочноеПоле
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Другое);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры,
		РезультатЗапроса.ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры
	
Процедура ОбновитьВидПоляДругое(Параметры) Экспорт
	
	ВидКонтактнойИнформацииСсылка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, "Справочник.ВидыКонтактнойИнформации");
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	Пока ВидКонтактнойИнформацииСсылка.Следующий() Цикл
		Попытка
			ВидКонтактнойИнформации = ВидКонтактнойИнформацииСсылка.Ссылка.ПолучитьОбъект();
			Если ВидКонтактнойИнформации.УдалитьМногострочноеПоле Тогда
				ВидКонтактнойИнформации.ВидПоляДругое = "МногострочноеШирокое";
			Иначе
				ВидКонтактнойИнформации.ВидПоляДругое = "ОднострочноеШирокое";
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидКонтактнойИнформации);
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			// Если не удалось обработать какой-либо вид контактной информации, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать вид контактной информации: %1 по причине: %2'"),
					ВидКонтактнойИнформацииСсылка.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Справочники.ВидыКонтактнойИнформации, ВидКонтактнойИнформацииСсылка.Ссылка, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, "Справочник.ВидыКонтактнойИнформации");
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре ОбновитьВидПоляДругое не удалось обработать некоторые виды контактной информации (пропущены): %1'"), 
				ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ВидыКонтактнойИнформации,,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Процедура ОбновитьВидПоляДругое обработала очередную порцию видов контактной информации: %1'"),
					ОбъектовОбработано));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// @@@.16/11/30-13:28:03.<УП>
// Устарела. Следует использовать УстановитьСвойстваВидаКонтактнойИнформации.
//
Процедура ОбновитьВидКонтактнойИнформации(Вид, Тип, Подсказка, МожноИзменятьСпособРедактирования, РедактированиеТолькоВДиалоге,
	ОбязательноеЗаполнение, Порядок = Неопределено, РазрешитьВводНесколькихЗначений = Ложь, НастройкиПроверки = Неопределено) Экспорт
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид = Вид;
	ПараметрыВида.Тип = Тип;
	//ПараметрыВида.Подсказка = Подсказка; // В новом БСП нет
	ПараметрыВида.МожноИзменятьСпособРедактирования = МожноИзменятьСпособРедактирования;
	ПараметрыВида.РедактированиеТолькоВДиалоге = РедактированиеТолькоВДиалоге;
	ПараметрыВида.ОбязательноеЗаполнение = ОбязательноеЗаполнение;
	ПараметрыВида.Порядок = Порядок;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = РазрешитьВводНесколькихЗначений;
	ПараметрыВида.НастройкиПроверки = НастройкиПроверки;
	ПараметрыВида.ЗапретитьРедактированиеПользователем = Ложь;
	ПараметрыВида.ВидПоляДругое = Порядок;
	
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

// @@@.16/11/30-13:23:05.<УП>
// Процедура обновления ИБ для справочника видов контактной информации.
//
// Инструкция:
// Для каждого объекта, владельца КИ, для каждого соответствующего ему вида КИ добавить 
// строчку вида: ОбновитьВидКонтактнойИнформации(.....). При этом,
// важен порядок в котором будут осуществляться эти вызовы, чем раньше вызов для вида КИ,
// тем выше этот вид КИ будет располагаться на форме объекта.
//
// Параметры функции ОбновитьВидКонтактнойИнформации:
//    1. Вид - Справочник.ВидыКонтактнойИнформации - вид контактной информации.
//    2. Тип - Перечисление.ТипыКонтактнойИнформации - тип контактной информации.
//    3. Подсказка - Строка - Подсказка к виду контактной информации.
//    4. МожноИзменятьСпособРедактирования - Булево - Истина, если есть возможность изменять настройки вида, Ложь - иначе.
//    5. РедактированиеТолькоВДиалоге - Булево - Истина, если редактировать только в диалоге, Ложь - иначе.
//    6. ОбязательноеЗаполнение - Булево - Истина, если требуется обязательное заполнение поля, Ложь - иначе.
//    7. Порядок - Неопределено или Число - порядок вида контактной информации, положение в списке относительно других элементов: 
//                                         Неопределено - не переназначать;
//                                         0            - назначить автоматически;
//                                         Число > 0    - назначить указанный порядок.
//    8. РазрешитьВводНесколькихЗначений - Булево - Признак возможности использования дополнительных полей ввода для данного вида.
//    9. НастройкиПроверки
//        Для типа Адрес - Структура
//            АдресТолькоРоссийский - Булево - Истина, если используются только российские адреса, Ложь - иначе.
//            ПроверятьКорректность - Булево - Истина, если используется проверка адреса по классификатору (Только если АдресТолькоРоссийский = Истина), Ложь - иначе.
//            ЗапрещатьВводНекорректного - - Булево - Истина, если требуется запрещать пользователю записывать некорректный адрес (Только если ПроверятьКорректность = Истина), Ложь - иначе.
//            СкрыватьНеактуальныеАдреса - Булево - Истина, если не требуется показывать неактуальные адреса при вводе(Только если АдресТолькоРоссийский = Истина), Ложь - иначе.
//            ВключатьСтрануВПредставление - Булево - Истина, если требуется включать наименование страны в представление адреса, Ложь - иначе.
//            Для типа АдресЭлектроннойПочты - Структура
//            ПроверятьКорректность - Булево - Истина, если требуется проверка адреса электронной почты на корректность, Ложь - иначе.
//            ЗапрещатьВводНекорректного - Булево - Истина, если требуется запрещать пользователю записывать некорректный адрес (Только если ПроверятьКорректность = Истина), Ложь - иначе.
//            Для остальных типов или для задания настроек по умолчанию используется Неопределено
Процедура ЗаполнитьСвойстваВидовКонтактнойИнформации() Экспорт
	
	ПараметрыПроверкиАдреса = Новый Структура;
	ПараметрыПроверкиАдреса.Вставить("АдресТолькоРоссийский",        Ложь);
	ПараметрыПроверкиАдреса.Вставить("ПроверятьКорректность",        Ложь);
	ПараметрыПроверкиАдреса.Вставить("ЗапрещатьВводНекорректного",   Ложь);
	ПараметрыПроверкиАдреса.Вставить("СкрыватьНеактуальныеАдреса",   Ложь);
	ПараметрыПроверкиАдреса.Вставить("ВключатьСтрануВПредставление", Истина);
	
	#Область СтандартныеПодсистемы
	
	// СтандартныеПодсистемы.Пользователи
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailПользователя, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
	    НСтр("ru='Email пользователя'"), Истина, Ложь, Ложь, 1);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонПользователя            , Перечисления.ТипыКонтактнойИнформации.Телефон,               
	    НСтр("ru='Телефон пользователя'"), Истина, Ложь, Ложь, 2);
	// Конец СтандартныеПодсистемы.Пользователи
	
	// СтандартныеПодсистемы.Организации
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации             , Перечисления.ТипыКонтактнойИнформации.Адрес,
	    НСтр("ru='Юридический адрес организации'"), Истина, Ложь, Ложь, 3,, ПараметрыПроверкиАдреса);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации           , Перечисления.ТипыКонтактнойИнформации.Адрес,
	    НСтр("ru='Фактический адрес организации'"), Истина, Ложь, Ложь, 4,, ПараметрыПроверкиАдреса);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации       , Перечисления.ТипыКонтактнойИнформации.Адрес, 
	    НСтр("ru='Почтовый адрес организации'"), Истина, Ложь, Ложь, 5,, ПараметрыПроверкиАдреса);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации             , Перечисления.ТипыКонтактнойИнформации.Телефон,
	    НСтр("ru='Телефон организации'"), Истина, Ложь, Ложь, 6);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ФаксОрганизации                , Перечисления.ТипыКонтактнойИнформации.Факс,
	    НСтр("ru='Факс организации'"), Истина, Ложь, Ложь, 7);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailОрганизации               , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
	    НСтр("ru='Email организации'"), Истина, Ложь, Ложь, 8);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации    , Перечисления.ТипыКонтактнойИнформации.Другое, 
	    НСтр("ru='Другая информация об организации'"), Истина, Ложь, Ложь, 9);
	// Конец СтандартныеПодсистемы.Организации
	
	#КонецОбласти 	

	// Справочник "упАдреса"
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.Адрес                          , Перечисления.ТипыКонтактнойИнформации.Адрес,
		НСтр("ru='Адрес'"), Истина, Ложь, Истина, 10, , ПараметрыПроверкиАдреса);

	// Справочник "упКонтрагенты"
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента		        , Перечисления.ТипыКонтактнойИнформации.Адрес,
	    НСтр("ru='Юридический адрес контрагента'"), Истина, Ложь, Ложь, 11,, ПараметрыПроверкиАдреса);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента		    , Перечисления.ТипыКонтактнойИнформации.Адрес,
	    НСтр("ru='Фактический адрес контрагента'"), Истина, Ложь, Ложь, 12,, ПараметрыПроверкиАдреса);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента       , Перечисления.ТипыКонтактнойИнформации.Адрес,
	    НСтр("ru='Почтовый адрес контрагента'"), Истина, Ложь, Ложь, 13,, ПараметрыПроверкиАдреса);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента		        , Перечисления.ТипыКонтактнойИнформации.Телефон,
	    НСтр("ru='Телефон контрагента'"), Истина, Ложь, Ложь, 14);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ФаксКонтрагенты                , Перечисления.ТипыКонтактнойИнформации.Факс, 
	    НСтр("ru='Факс контрагента'"), Истина, Ложь, Ложь, 15);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailКонтрагента               , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
	    НСтр("ru='Email контрагента'"), Истина, Ложь, Ложь, 16);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагенты    , Перечисления.ТипыКонтактнойИнформации.Другое,
	    НСтр("ru='Другая информация о контрагенте'"), Истина, Ложь, Ложь, 17);
	
	// Справочник "упПартнеры"
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.АдресПартнера                  , Перечисления.ТипыКонтактнойИнформации.Адрес,
	    НСтр("ru='Адрес партнера'"), Истина, Ложь, Ложь, 18,, ПараметрыПроверкиАдреса);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонПартнера                , Перечисления.ТипыКонтактнойИнформации.Телефон,
	    НСтр("ru='Телефон партнера'"), Истина, Ложь, Ложь, 19);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailПартнера                  , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
	    НСтр("ru='Email партнера'"), Истина, Ложь, Ложь, 20);
	
	// Справочник "упКонтактныеЛицаПартнеров"
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица         , Перечисления.ТипыКонтактнойИнформации.Телефон,
	    НСтр("ru='Телефон контактного лица партнера'"), Истина, Ложь, Ложь, 21);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица, Перечисления.ТипыКонтактнойИнформации.Телефон,
	    НСтр("ru='Мобильный телефон контактного лица партнера'"), Истина, Ложь, Ложь, 22);
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица           , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
	    НСтр("ru='Email контактного лица партнера'"), Истина, Ложь, Ложь, 23);
	
	// Справочник "упСотрудники"
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailСотрудника                , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
	    НСтр("ru='Email сотрудника'"), Истина, Ложь, Ложь, 24);
	//ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника              , Перечисления.ТипыКонтактнойИнформации.Телефон,               
	//    НСтр("ru='Телефон сотрудника'"), Истина, Ложь, Ложь, 25);
	
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица              , Перечисления.ТипыКонтактнойИнформации.Телефон,               
	    НСтр("ru='Рабочий телефон'"), Истина, Ложь, Ложь, 22);
		
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица              , Перечисления.ТипыКонтактнойИнформации.Телефон,               
	    НСтр("ru='Мобильный телефон'"), Истина, Ложь, Ложь, 20);
		
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица              , Перечисления.ТипыКонтактнойИнформации.Телефон,               
	    НСтр("ru='Домашний телефон'"), Истина, Ложь, Ложь, 24);
		
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица              , Перечисления.ТипыКонтактнойИнформации.Адрес,               
	    НСтр("ru='Адрес по прописке'"), Истина, Ложь, Ложь, 26);
		
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица              , Перечисления.ТипыКонтактнойИнформации.Адрес,               
	    НСтр("ru='Адрес места проживания'"), Истина, Ложь, Ложь, 27);
		
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.АдресЗаПределамиРФФизическиеЛица              , Перечисления.ТипыКонтактнойИнформации.Адрес,               
	    НСтр("ru='Адрес за пределами РФ'"), Истина, Ложь, Ложь, 25);
		
	ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица              , Перечисления.ТипыКонтактнойИнформации.Адрес,               
	    НСтр("ru='Адрес для информирования'"), Истина, Ложь, Ложь, 23);
	
КонецПроцедуры

#КонецЕсли
